MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
/* Biquad filter state for loudness (stereo - L and R channels) */
/* Low-shelf filter: boost bass frequencies (+6dB @ 100Hz) */
typedef struct {
    float x1, x2;  /* Input history */
    float y1, y2;  /* Output history */
} BiquadState;

static BiquadState loudness_state_L = {0};
static BiquadState loudness_state_R = {0};

/* Biquad coefficients for low-shelf filter
 * Calculated for: Fs=44100Hz, Fc=150Hz, Gain=+6dB, Q=0.707
 * Using Audio EQ Cookbook formula (Robert Bristow-Johnson) */
static const float loudness_b0 = 1.005260f;
static const float loudness_b1 = -1.974408f;
static const float loudness_b2 = 0.969786f;
static const float loudness_a1 = -1.974567f;
static const float loudness_a2 = 0.974887f;

/* Apply biquad filter to a single sample */
static inline float biquad_process(BiquadState *state, float input)
{
    float output = loudness_b0 * input
                 + loudness_b1 * state->x1
                 + loudness_b2 * state->x2
                 - loudness_a1 * state->y1
                 - loudness_a2 * state->y2;

    /* Shift history */
    state->x2 = state->x1;
    state->x1 = input;
    state->y2 = state->y1;
    state->y1 = output;

    return output;
}

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SAI2_Init(void);
void Error_Handler(void);

/* Audio processing */
static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples);

/* Debug printf redirection to USART3 */
int _write(int file, char *ptr, int len)
{
    HAL_UART_Transmit(&huart3, (uint8_t *)ptr, len, HAL_MAX_DELAY);
    return len;
}

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();          // DMA must be initialized before peripherals that use it
    MX_USART3_UART_Init();  // Debug console first

    /* Boot message with build number */
    printf("\r\n\r\n*** 42dB DSP Engine (Build #%d) ***\r\n", BUILD_NUMBER);

    printf("[OK] HAL initialized\r\n");
    printf("[OK] Clock configured\r\n");
    printf("[OK] GPIO initialized\r\n");
    printf("[OK] DMA initialized\r\n");
    printf("[OK] USART3 (debug console) initialized\r\n");

    MX_USART2_UART_Init();  // ESP32 BLE control
    printf("[OK] USART2 (ESP32 BLE) initialized\r\n");

    MX_SAI2_Init();  // I2S Audio
    printf("[OK] SAI2 (I2S Audio) initialized\r\n");
    printf("[NOTE] Use 74HCT04 buffer for I2S signals (5V tolerant)\r\n");

    /* Print startup banner */
    printf("\r\n");
    printf("========================================\r\n");
    printf("42dB DSP Engine v0.2\r\n");
    printf("========================================\r\n");
    printf("ESP32 BLE: PD5(TX), PD6(RX) @ 115200\r\n");
    printf("Debug:     PD8(TX), PD9(RX) @ 115200\r\n");
    printf("I2S Input: PD13(SCK), PD12(FS), PD11(SD)\r\n");
    printf("I2S Output: PA0(SD)\r\n");
    printf("Audio:     %d Hz, %d ch, %d samples/buf\r\n",
           AUDIO_SAMPLE_RATE, AUDIO_CHANNELS, AUDIO_BUFFER_SAMPLES);
    printf("========================================\r\n\r\n");

    /* Start receiving data from ESP32 via interrupt */
    HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    printf("[OK] USART2 RX interrupt enabled\r\n");

    /* Clear audio buffers */
    memset(audio_rx_buffer, 0, sizeof(audio_rx_buffer));
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Clear any pending SAI errors and flush FIFOs before starting */
    __HAL_SAI_CLEAR_FLAG(&hsai_rx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);
    __HAL_SAI_CLEAR_FLAG(&hsai_tx, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET | SAI_FLAG_WCKCFG);

    /* Flush FIFOs */
    SAI2_Block_A->CR2 |= SAI_xCR2_FFLUSH;
    SAI2_Block_B->CR2 |= SAI_xCR2_FFLUSH;

    /* Pre-fill TX buffer with silence to avoid garbage at startup */
    memset(audio_tx_buffer, 0, sizeof(audio_tx_buffer));

    /* Start RX DMA first to receive audio data from ESP32/BM83 */
    HAL_StatusTypeDef rx_status = HAL_SAI_Receive_DMA(&hsai_rx, (uint8_t *)audio_rx_buffer,
                                                       AUDIO_BUFFER_SIZE * 2);

    /* Start TX DMA - synchronized to RX for same clock */
    HAL_StatusTypeDef tx_status = HAL_SAI_Transmit_DMA(&hsai_tx, (uint8_t *)audio_tx_buffer,
                                                        AUDIO_BUFFER_SIZE * 2);

    if (rx_status == HAL_OK && tx_status == HAL_OK)
    {
        printf("[OK] SAI2 RX+TX DMA started (passthrough mode)\r\n");
    }
    else
    {
        printf("[WARN] DMA start failed: RX=%d TX=%d\r\n", rx_status, tx_status);
    }

    printf("\r\n[INFO] PASSTHROUGH MODE - Audio from ESP32 to DAC\r\n");
    printf("       RX: BCLK->PD13, LRCK->PD12, SD->PD11\r\n");
    printf("       TX: SD->PA0 (shares BCLK/LRCK from ESP32)\r\n\r\n");

    /* Debug: print SAI and GPIO register status */
    printf("[DEBUG] SAI2_A CR1=0x%08lX SR=0x%08lX\r\n",
           SAI2_Block_A->CR1, SAI2_Block_A->SR);
    printf("[DEBUG] SAI2_B CR1=0x%08lX SR=0x%08lX\r\n",
           SAI2_Block_B->CR1, SAI2_Block_B->SR);
    /* GPIO mode and alternate function for PD11,12,13 */
    printf("[DEBUG] GPIOD MODER=0x%08lX AFR[1]=0x%08lX\r\n",
           GPIOD->MODER, GPIOD->AFR[1]);
    /* GPIO for PA0 (SAI2_B output) */
    printf("[DEBUG] GPIOA MODER=0x%08lX AFR[0]=0x%08lX\r\n",
           GPIOA->MODER, GPIOA->AFR[0]);
    /* Check SAI2 clock source */
    printf("[DEBUG] RCC D2CCIP1R=0x%08lX (SAI23SEL bits 8:6)\r\n",
           RCC->D2CCIP1R);
    /* Read GPIO input values to verify signals */
    printf("[DEBUG] GPIOD IDR=0x%04lX (PD11=%d PD12=%d PD13=%d)\r\n",
           GPIOD->IDR,
           (GPIOD->IDR >> 11) & 1,
           (GPIOD->IDR >> 12) & 1,
           (GPIOD->IDR >> 13) & 1);

    /* Variables for periodic status */
    uint32_t last_status_time = 0;
    uint32_t last_buffer_count = 0;
    uint32_t debug_counter = 0;

