MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
    /* Infinite loop */
    while (1)
    {
        /* Audio processing happens in RX DMA callbacks for lowest latency */

        /* Print status every second */
        uint32_t now = HAL_GetTick();
        if (now - last_status_time >= 1000)
        {
            uint32_t buffers_per_sec = audio_buffer_count - last_buffer_count;
            if (audio_buffer_count > 0)
            {
                printf("[AUDIO] Buffers/sec: %lu, Total: %lu, Overruns: %lu\r\n",
                       buffers_per_sec, audio_buffer_count, audio_overrun_count);
            }
            /* Debug: show SAI and DMA status every 5 seconds */
            debug_counter++;
            if ((debug_counter % 5) == 0)
            {
                printf("[DEBUG] SAI_A: SR=0x%lX CR1=0x%08lX\r\n",
                       SAI2_Block_A->SR, SAI2_Block_A->CR1);
                printf("[DEBUG] SAI_B: SR=0x%lX CR1=0x%08lX\r\n",
                       SAI2_Block_B->SR, SAI2_Block_B->CR1);
                printf("[DEBUG] DMA RX: CR=0x%lX NDTR=%lu\r\n",
                       DMA1_Stream0->CR, DMA1_Stream0->NDTR);
                printf("[DEBUG] DMA TX: CR=0x%lX NDTR=%lu\r\n",
                       DMA1_Stream1->CR, DMA1_Stream1->NDTR);
                extern volatile uint32_t audio_process_count;
                /* Print samples from start, middle and near DMA position */
                uint32_t dma_pos = 1024 - DMA1_Stream0->NDTR;

                /* Read SAI DR directly (may cause FIFO issues, just for debug) */
                uint32_t sai_dr = SAI2_Block_A->DR;

                printf("[DEBUG] RX[0..3]: %d %d %d %d\r\n",
                       audio_rx_buffer[0], audio_rx_buffer[1],
                       audio_rx_buffer[2], audio_rx_buffer[3]);
                printf("[DEBUG] TX[0..3]: %d %d %d %d\r\n",
                       audio_tx_buffer[0], audio_tx_buffer[1],
                       audio_tx_buffer[2], audio_tx_buffer[3]);
                printf("[DEBUG] Process=%lu, DMA_TX_NDTR=%lu\r\n",
                       audio_process_count, (uint32_t)DMA1_Stream1->NDTR);
            }
            last_buffer_count = audio_buffer_count;
            last_status_time = now;
        }

        /* Process ESP32 UART data - accumulate into line buffer */
        while (rx_head != rx_tail)
        {
            uint8_t data = rx_buffer[rx_tail];
            rx_tail = (rx_tail + 1) % RX_BUFFER_SIZE;

            if (data == '\n')
            {
                /* End of line - process command */
                line_buffer[line_pos] = '\0';
                if (line_pos > 0 && line_buffer[line_pos - 1] == '\r')
                {
                    line_buffer[line_pos - 1] = '\0';  /* Remove \r */
                }
                if (line_pos > 0)
                {
                    Process_GATT_Command(line_buffer);
                }
                line_pos = 0;
            }
            else if (line_pos < LINE_BUFFER_SIZE - 1)
            {
                line_buffer[line_pos++] = (char)data;
            }
        }

        /* Small delay to prevent tight loop when no audio */
        HAL_Delay(1);
    }
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /** Supply configuration update enable
     */
    HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

    /** Configure the main internal regulator output voltage
     */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

    while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

    /** Initializes the RCC Oscillators according to the specified parameters
     * in the RCC_OscInitTypeDef structure.
     */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 1;
    RCC_OscInitStruct.PLL.PLLN = 120;
    RCC_OscInitStruct.PLL.PLLP = 2;
    RCC_OscInitStruct.PLL.PLLQ = 2;
    RCC_OscInitStruct.PLL.PLLR = 2;
    RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_3;
    RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
    RCC_OscInitStruct.PLL.PLLFRACN = 0;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /** Initializes the CPU, AHB and APB buses clocks
     */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                                |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
    RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief USART2 Initialization Function (ESP32 Communication)
 * @param None
 * @retval None
 */
static void MX_USART2_UART_Init(void)
{
    huart2.Instance = USART2;
    huart2.Init.BaudRate = 115200;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    huart2.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart2.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart2.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    if (HAL_UART_Init(&huart2) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
 * @brief USART3 Initialization Function (Debug Console / VCP)
 * @param None
 * @retval None
 */
static void MX_USART3_UART_Init(void)
{
    huart3.Instance = USART3;
    huart3.Init.BaudRate = 115200;
    huart3.Init.WordLength = UART_WORDLENGTH_8B;
    huart3.Init.StopBits = UART_STOPBITS_1;
    huart3.Init.Parity = UART_PARITY_NONE;
    huart3.Init.Mode = UART_MODE_TX_RX;
    huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    huart3.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart3.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

