MYBLtd/ChaoticVolt-42dB_STM32_DSP_engine/Core/Src/main.c
static uint32_t sine_phase = 0;

/**
 * @brief  Parse hex string to bytes
 * @param  hex: Input hex string (e.g., "0164")
 * @param  out: Output byte array
 * @param  max_len: Maximum bytes to parse
 * @retval Number of bytes parsed
 */
static int hex_to_bytes(const char *hex, uint8_t *out, int max_len)
{
    int len = 0;
    while (*hex && *(hex + 1) && len < max_len)
    {
        char byte_str[3] = {hex[0], hex[1], '\0'};
        out[len++] = (uint8_t)strtol(byte_str, NULL, 16);
        hex += 2;
    }
    return len;
}

/**
 * @brief  Process GATT command received from ESP32
 *         Format: GATT:<characteristic>:<hex_data>
 *         Example: GATT:CTRL:0102 (Set preset to NIGHT)
 * @param  line: Complete line without \r\n
 */
static void Process_GATT_Command(const char *line)
{
    /* Check if it's a GATT command */
    if (strncmp(line, "GATT:", 5) != 0)
    {
        printf("[ESP32] %s\r\n", line);
        return;
    }

    /* Parse: GATT:<char>:<hex> */
    const char *char_start = line + 5;
    const char *colon = strchr(char_start, ':');
    if (!colon)
    {
        printf("[ESP32] Invalid GATT format: %s\r\n", line);
        return;
    }

    /* Extract characteristic name */
    int char_len = colon - char_start;
    char char_name[32];
    if (char_len >= (int)sizeof(char_name)) char_len = sizeof(char_name) - 1;
    strncpy(char_name, char_start, char_len);
    char_name[char_len] = '\0';

    /* Extract hex data */
    const char *hex_data = colon + 1;
    uint8_t cmd_bytes[16];
    int cmd_len = hex_to_bytes(hex_data, cmd_bytes, sizeof(cmd_bytes));

    /* Log the command */
    printf("[GATT] %s:", char_name);
    for (int i = 0; i < cmd_len; i++)
    {
        printf(" %02X", cmd_bytes[i]);
    }
    printf("\r\n");

    /* Handle specific commands - accept any characteristic that ends with "CTRL" or "TRL"
     * to handle occasional UART byte loss */
    if ((strstr(char_name, "CTRL") != NULL || strstr(char_name, "TRL") != NULL) && cmd_len >= 2)
    {
        uint8_t cmd_type = cmd_bytes[0];
        uint8_t cmd_value = cmd_bytes[1];

        switch (cmd_type)
        {
            case 0x01:  /* Set Preset */
                printf("[DSP] Set preset: %d\r\n", cmd_value);
                /* TODO: Apply preset to DSP */
                break;
            case 0x02:  /* Set Loudness */
                printf("[DSP] Loudness: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_loudness_enabled = cmd_value ? 1 : 0;
                if (!cmd_value) {
                    /* Reset filter state when disabling to avoid clicks */
                    memset(&loudness_state_L, 0, sizeof(loudness_state_L));
                    memset(&loudness_state_R, 0, sizeof(loudness_state_R));
                }
                break;
            case 0x04:  /* Set Mute */
                printf("[DSP] Mute: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_mute_enabled = cmd_value ? 1 : 0;
                break;
            case 0x07:  /* Set Volume / Device Trim */
                {
                    uint8_t trim = cmd_value > 100 ? 100 : cmd_value;
                    device_trim_value = trim;
                    update_target_gain();
                    printf("[DSP] Trim: %d%% (target gain: %.3f)\r\n",
                           trim, target_gain);
                }
                break;
            case 0x08:  /* Set Bypass */
                printf("[DSP] Bypass: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_bypass_enabled = cmd_value ? 1 : 0;
                break;
            case 0x09:  /* Set Bass Boost */
                printf("[DSP] Bass Boost: %s\r\n", cmd_value ? "ON" : "OFF");
                dsp_bass_boost_enabled = cmd_value ? 1 : 0;
                break;
            default:
                printf("[DSP] Unknown command: 0x%02X\r\n", cmd_type);
                break;
        }
    }
}

static void Audio_Process(int16_t *rx_buf, int16_t *tx_buf, uint16_t samples)
{
    audio_process_count++;

    /* Bypass mode: direct passthrough without any processing */
    if (dsp_bypass_enabled)
    {
        memcpy(tx_buf, rx_buf, samples * sizeof(int16_t));
        return;
    }

    /* Process stereo samples (L, R, L, R, ...) */
    for (uint16_t i = 0; i < samples; i += 2)
    {
        /* Smooth gain ramping - approach target gain gradually */
        current_gain += (target_gain - current_gain) * GAIN_RAMP_COEFF;

        /* Get input samples as float (-1.0 to 1.0 range) */
        float left_in  = (float)rx_buf[i]     / 32768.0f;
        float right_in = (float)rx_buf[i + 1] / 32768.0f;

        float left_out  = left_in;
        float right_out = right_in;

        /* Apply DSP chain */

        /* 1. Loudness: Low-shelf bass boost */
        if (dsp_loudness_enabled)
        {
            left_out  = biquad_process(&loudness_state_L, left_out);
            right_out = biquad_process(&loudness_state_R, right_out);
        }

        /* 2. Apply volume/trim with smooth ramping */
        left_out  *= current_gain;
        right_out *= current_gain;

        /* 3. Mute: Zero output (after gain for smooth mute) */
        if (dsp_mute_enabled)
        {
            left_out  = 0.0f;
            right_out = 0.0f;
        }

        /* Soft clipping to prevent harsh distortion */
        if (left_out > 1.0f) left_out = 1.0f;
        if (left_out < -1.0f) left_out = -1.0f;
        if (right_out > 1.0f) right_out = 1.0f;
        if (right_out < -1.0f) right_out = -1.0f;

        /* Convert back to 16-bit integer */
        tx_buf[i]     = (int16_t)(left_out  * 32767.0f);
        tx_buf[i + 1] = (int16_t)(right_out * 32767.0f);
    }
}

/**
 * @brief  SAI Rx Half Complete callback - copy to TX for passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_RxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
    if (hsai->Instance == SAI2_Block_A)
    {
        Audio_Process(audio_rx_buffer, audio_tx_buffer, AUDIO_BUFFER_SIZE);
        audio_buffer_count++;
    }
}

/**
 * @brief  SAI Rx Complete callback - copy to TX for passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_RxCpltCallback(SAI_HandleTypeDef *hsai)
{
    if (hsai->Instance == SAI2_Block_A)
    {
        Audio_Process(&audio_rx_buffer[AUDIO_BUFFER_SIZE],
                     &audio_tx_buffer[AUDIO_BUFFER_SIZE], AUDIO_BUFFER_SIZE);
        audio_buffer_count++;
    }
}

/**
 * @brief  SAI Tx Half Complete callback - RX callback handles passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_TxHalfCpltCallback(SAI_HandleTypeDef *hsai)
{
    (void)hsai;
}

/**
 * @brief  SAI Tx Complete callback - RX callback handles passthrough
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_TxCpltCallback(SAI_HandleTypeDef *hsai)
{
    (void)hsai;
}

/**
 * @brief  SAI Error callback
 * @param  hsai: SAI handle
 * @retval None
 */
volatile uint32_t sai_error_count_a = 0;
volatile uint32_t sai_error_count_b = 0;
volatile uint32_t sai_last_error_a = 0;
volatile uint32_t sai_last_error_b = 0;

void HAL_SAI_ErrorCallback(SAI_HandleTypeDef *hsai)
{
    if (hsai->Instance == SAI2_Block_A)
    {
        sai_error_count_a++;
        sai_last_error_a = hsai->ErrorCode;
        /* Just clear flags, don't restart DMA from interrupt */
        __HAL_SAI_CLEAR_FLAG(hsai, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET);
    }
    else if (hsai->Instance == SAI2_Block_B)
    {
        sai_error_count_b++;
        sai_last_error_b = hsai->ErrorCode;
        __HAL_SAI_CLEAR_FLAG(hsai, SAI_FLAG_OVRUDR | SAI_FLAG_AFSDET | SAI_FLAG_LFSDET);
    }
}

/**
 * @brief  Rx Transfer completed callback
 * @param  huart UART handle
 * @retval None
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        /* Store byte in ring buffer */
        rx_buffer[rx_head] = rx_byte;
        rx_head = (rx_head + 1) % RX_BUFFER_SIZE;

        /* Continue receiving */
        HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    }
}

/**
 * @brief  UART Error callback - required for continuous reception
 * @param  huart UART handle
 * @retval None
 */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2)
    {
        /* Abort resets the HAL state machine properly */
        HAL_UART_Abort(huart);

        /* Clear all error flags */
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF | UART_CLEAR_FEF |
                              UART_CLEAR_NEF | UART_CLEAR_OREF);

        /* Re-arm reception */
        HAL_UART_Receive_IT(&huart2, &rx_byte, 1);
    }
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
    /* User can add his own implementation to report the HAL error return state */
    __disable_irq();
    while (1)
    {
    }
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
}
#endif /* USE_FULL_ASSERT */
